{"data": [{"title": "Former Quicken Loans / Rocket Mortgage (RKT) 🚀 Employee telling you what Rocket really is & where it's going....", "text": "I worked for Rocket  🚀 / Quicken Loans for 6 years as a mortgage banker. Literally the best place to work in the world. The culture and atmosphere is next level and the money making opportunity is  🔥 .\n\nHere are some thoughts as to why this stock will be $100+ in the next 18 months and why it literally cannot go tits up!\n\n\\- I have a lot of high up friends there still and some on the capital markets team I have been pestering for info on any announcements coming. The only thing I could get out of them is that the earnings are going to be RETARTED 🚀  and a few new partnerships will be announced.  The guidance will be  🔥🔥🔥  as well but they would not give me the specifics. \n\n\\- The term 'Rocket'  🚀  has actually been around for over 10 years before they even considered changing the name to Rocket  🚀 . It is tied with the PROPRIETARY technology they created within the company. It means to submit a consumer's profile through their software which is linked directly to Fannie Mae, Freddie Mac, VA, FHA, and USDA. This is what allows them to get precise real time approvals and denials on loans.  No other company, bank, lender, ect. has this.....But they want it. This is also why Rocket 🚀  closes their loans faster than anyone else in the industry. This technology alone is worth Billions. It will not be long before they start leasing this out or even selling it. \n\n\\- Rocket 🚀  is so far ahead of the competition it is not even funny. Every company has teams of people who constantly study their competition to try and stay ahead of the curve. When I was there, our people literally stopped looking at banks and mortgage companies because they were so far behind. They started doing walkthroughs with Amazon, Fedex, Facebook, and other big techs to make sure they had everything in line. This was over 4 years ago. I can't even imagine how far ahead they are now. There was always an ongoing joke 'We are actually a technology company that just so happens to do mortgages'\n\n&#x200B;\n\n\\-This State Farm & Rocket 🚀  deal may seem like old news... It is. However they literally just started streaming their clients through the pipeline. These numbers will not even be reflected in the earnings next week. This is just one of MULTIPLE insurance companies who are jumping on the  🚀 to have them originate their clients mortgages. \n\nhttps://preview.redd.it/d2vxp7a14vi61.jpg?width=615&format=pjpg&auto=webp&s=ef6768df86959f22b54d1fea9471c8662577c025\n\n\\- Client service is key. FACT: The number 1 complaint in the entire mortgage industry is not getting a call or email back from their banker. Rocket 🚀  has a ZERO tolerance policy referred to as NRCC (No return call complaint). This means if you do not return a voicemail or email in 24 hours YOU ARE GONE. If email or VM is on Friday you can call back Monday. Their customer service is so high level it actually ruined it for me when I deal with other companies in my personal life. 99% of every customer service person I have ever spoke to is straight trash. Rocket  🚀  is the GOAT of customer service. It is things like this that make companies last.\n\n&#x200B;\n\nhttps://preview.redd.it/i0kqexqz5vi61.jpg?width=528&format=pjpg&auto=webp&s=171dda3417972f41d6d618f1e3c25dcabfb028db\n\n&#x200B;\n\nhttps://preview.redd.it/xi1x1tq26vi61.jpg?width=479&format=pjpg&auto=webp&s=2ea0a2f761c093234967a8ad6bf99e25fe87a3ae\n\n\\^\\^\\^Can you guess who has been #1 on this list every year for over 10 years?..... 🚀 \n\n&#x200B;\n\n\\- Have you ever had your mortgage sold to some B.S servicing company within months after it closed with your original bank or lender? Yes, everyone has. Unless.....your mortgage is with Rocket 🚀 . That's correct, They service their loans so you don't have to worry about it getting sold off to India. You know why these other B.S companies do not? Because they do not have the capacity to properly handle them. Rocket 🚀  is MASSIVE and only getting bigger and better.\n\n&#x200B;\n\nhttps://preview.redd.it/d3stxz7q8vi61.jpg?width=709&format=pjpg&auto=webp&s=4ca0830a6f693da7b00ea9fad2bbd1a3ff20f7b8\n\nITS NOT EVEN CLOSE! This margin between Rocket 🚀  and the rest keeps growing. It will not stop.\n\n&#x200B;\n\n\\-The Warren Buffet theory I heard floating around the past couple of weeks... Its actually half true. Warren and Dan have been in bed together for YEARS. I've seen him at our headquarters 3 times and shook his hand once. Warren even insured Quicken Loans Billion dollar March Madness Bracket Challenge years ago. It's only a matter of time before the all you can eat Warren Buffet takes a massive position in the company.\n\n&#x200B;\n\nI know this is not the traditional DD but maybe an inside take would give anyone on the fence a better  perspective. \n\nPosition: 500 shares & March Calls\n\n&#x200B;\n\nTL;DR:         Buy 🚀 bank account go 🚀", "comments": [{"body": ">I worked for Rocket 🚀 / Quicken Loans for 6 years as a mortgage banker\n\nI totally trust you, random internet person.", "created": 1613929612.0}, {"body": "What happens evictions are lifted and everyone’s selling their homes and not buying?", "created": 1613929601.0}, {"body": "this is P&D and is illegal, calling SEC right now", "created": 1613929568.0}, {"body": "Proof of work and positions", "created": 1613929802.0}, {"body": "I gave up on a refinance with Rocket just a couple months ago because of the ridiculous lack of communication and customer support (then-existing loan was with them). Ended up going with someone else. According to your post a bunch of people must have gotten fired..", "created": 1613929857.0}], "created": 1613929472.0}, {"title": "[DD] Why $TDS is 200 IQ buy", "text": "I am not an investment professional and recently transitioned 100% of my brokerage portfolio to $TDS shares.   I just wanted to share my analysis and really don't care if you buy TDS because I am holding for the long term and believe in the company and my analysis.  TLDR at end.\n\n**Summary**\n\n* I found about TDS this past year when my rural area was given another internet option aside from Charter.  I switched this December and pay $40 / mo for 300 mbs (I get closer to 200).  I previously was with Charter paying \\~$60 / mo for 100 mbs (I got 20-40).   Charter called me this Jan / Feb offering free internet and TV for 3 months because per them \"my entire neighborhood switched to TDS\".   I turned down the offer, opened a brokerage account and started buying TDS stock.\n* TDS is parent company of US Cellular and has their own fiber internet operation.\n\n**Fundamentals**\n\n* Currently trading at 0.46 / 1 price to book ratio.\n* $1.4B cash as of 12/31/2020.\n* Their operations brought in $1.5B cash in 2020\n* They have increased their dividend since at least 2011 - Div yield is currently 3.6%.\n* Their actual results continue to exceed estimates.\n   * [https://www.nasdaq.com/market-activity/stocks/tds/earnings#:\\~:text=Earnings%20announcement\\*%20for%20TDS%3A%20Feb%2018%2C%202021&text=According%20to%20Zacks%20Investment%20Research,quarter%20last%20year%20was%20%240.1](https://www.nasdaq.com/market-activity/stocks/tds/earnings#:~:text=Earnings%20announcement*%20for%20TDS%3A%20Feb%2018%2C%202021&text=According%20to%20Zacks%20Investment%20Research,quarter%20last%20year%20was%20%240.1).\n* They are investing in increasing their fiber footprint and into 5G to make US Cellular more relevant.   They own their own towers and sell excess capacity.\n* Still profitable even with incurring debt to finance these upfront costs.\n* 2019-2020 CAPEX increased 28%.  Net Income increased 86%.  (dollar for dollar)\n   * I am anticipating this trend to continue as their fiber becomes more available and they bring in more profit and cash.\n* Fiber technology - to my understanding - moves data at speed of light which is fastest anything can move (I think?).  This technology will be hard to compete with.\n* Potential M&A target as they steal market share and continue to become a more affordable acquisition.\n* [https://www.insider-monitor.com/trading/cik1051512.html](https://www.insider-monitor.com/trading/cik1051512.html)\n   * 1.2M+ in shares purchased through exercising stock options since 2019. Only 102k shares sold! 3k in 2020, 2021. This tells me insiders view their company as extremely undervalued and are refusing to sell (even though they could at a profit through discounted stock options).  **Look at the trend change between 2019-now and the past 10 years.  These guys are diamond handing their shares**\n* Internet is a utility staple that is not going any where.\n\n**The Bad**\n\n* TDS is parent of US Cellular - I don't know anyone who uses US Cellular.\n   * Rental income from towers helps mitigate this.\n* US Cellular brings in a portion of revenues from landlines - a dying service.\n* Majority of TDS expansion appears to be in rural areas - limited market share.\n* No one cares about dividend or value stocks when you can potential achieve 100%+ returns with other investments.\n* Starlink has ability to reach rural customers much quicker than TDS can complete fiber buildouts.\n   * Fiber appears to be much cheaper - \\~$40-50 / mo for internet as opposed to $499 + $99 / mo for Starlink.   Fiber has better performance.  I don't see how Starlink can compete with this once people get the option.\n\n**TLDR:** $TDS is trading below book value, poised for profitable growth, is an M&A target, increases their dividend, exceeds expectations, and has low downside so you guys probably won't be interested.    I am using my TDS fiber internet to post this.\n💎✋⬆️\n\n**Position:**\n\nhttps://imgur.com/a/GzecNhy", "comments": [{"body": "For some reason I come here for good stock ideas, so I like this post. Sounds like a responsible investment.", "created": 1613929030.0}, {"body": "ah yes big brain time", "created": 1613928375.0}, {"body": "Good luck fellow ape. Find your moon emoji.", "created": 1613928450.0}, {"body": "I like it, gonna have to look deeper into this one. thanks for the dd!!", "created": 1613929357.0}, {"body": "Positions or ban", "created": 1613928600.0}], "created": 1613928235.0}, {"title": "$HIMS - I like the stock", "text": "Full disclaimer I’m balls deep in $HIMS (I have large positions)\n\nALSO NONE OF THIS IS FINANCIAL ADVICE, I’M A RETARD JUST SHARING WHAT I THINK. \n\nHims & Hers is a next gen, millennial focused telehealth brand.\n\nJ-Lo & A Rod are investors and brand ambassadors.\n\nThrough J-Lo’s network they are regularly featured on celebrities IG’s, stories etc —> most recently Kylie Jenner (search and you’ll find some screenshots if you want to verify, but follow both Hers and Hims accounts on IG and they share on their stores diff celebs who post).\n\nTheir competitors e.g TDOC have a 42B marketcap, Hims is sitting at 3.5B right now\n\nThey’re launching a fuck load of new services including most recently mental health & antidepressants\n\nThey’re originally known for selling DICK PILLS and you know what happens to dicks on dick pills (they go up), and has real meme potential\n\nThe CEO has publicly said in multiple interviews he sees the company with a 20B valuation, from where it sits now at 3.5B (Google Hims CEO 20 billion valuation to find some examples)\n\nCEO is young, tech focused\n\nCathie Wood bought for one of the ARK ETF’s \n\nEarnings is mid March\n\nI LIKE THE STOCK. \n\nAnd I’m balls deep in it.\n\n🚀", "comments": [{"body": "This is some awful DD. How did this creep past the gay mods?", "created": 1613928300.0}, {"body": "You just reminded me that this is a stock LOL. I use/enjoy hims so I better put my money where my receding hairline is", "created": 1613929080.0}, {"body": "TDOC offers ways more than HIMS. HIMS is more like an online pharmacy with better branding and celebrity promoters. I think it will do fine but will not be on the same league as TDOC.\n\nThe company that I think may be able go compete with TDOC is ONEM.", "created": 1613928300.0}, {"body": "if they had better pharma offerings I would be in. but they're expanding to like clothes aren't they?", "created": 1613928706.0}, {"body": "In on HIMS myself. Plan on holding it long term", "created": 1613928835.0}], "created": 1613928031.0}, {"title": "GME possible upcoming catalysts", "text": "Upcoming GME “Possible” Catalysts\n\nThere are some great Due Diligence posts out there regarding the short percentage on GME, the hiding of the shorts game with An ETF that cannot be named here and other ETF’s, and the AI model of where GME could moon at because of this.  I encourage everyone to search and read all these posts as I encourage all investors to research anything they are investing in.  They are great reads put together by apes with many more wrinkles on their brain than I have.  These posts explain out the different methods that people who are going to lose a lot of money are using against retail.  The high frequency trading, the media, and the schill accounts.\n\nWe all know why we are here, duh it’s cause “we like the stock”. Here is some possible catalyst information everyone should know about.  Any one of these things could be the catalyst that starts the squeeze or they could just bomb. We don’t know exactly what will start the frenzy. What we do know is that costs to hold shorts will need to increase and shares need to be called in before the shorters find that line where it’s no longer cost effective to hold their position and they have to buy at any cost and we get our tendies.  So here is a list of certain key items coming up.\n\n1.  This weekend has created another major round of buzz concerning GME which started with the Congressional House Services Financial Committee Hearing on Thursday.  Then it really hit when u/deepfuckingvalue followed up to his response to the Congressman that he still though GME was a great value at its current price and then Friday put his money where his mouth is and bought another 50K shares.  Fucking legend.  That buzz has led into a lot of chatter this weekend that could start a FOMO buy on Monday.  A FOMO could drive the price which will cause the borrow rate of shorts to skyrocket and could cause lenders to start pulling back shares.  This “might” be all the catalyst we need to see the moon.\n\n2. An ETF that cannot be named here is being used and a way for shorters to short GME since the fund holds GME stock as a part of it portfolio.  If State Street performs quarterly balancing and reallocations of their ETF their could be a call back of shares.  Honestly we don’t know if this will happen since none of us know the inner working of exactly what they are going to do but this could be the start of events that squeeze GME.\n\n3. GME releases the quarterly earning on March 24th.  This report includes the sale of both new consoles as well as the Christmas rush.  In fact many stores opened back up after Covid lockdowns in the 4th quarter.  We also don’t know if any other information will be released at the time of the earnings report since they have been very tight lipped during this whole run other than announcing some new people that are going to help move GameStop in a new direction.\n\n4.  Annual call back of shares prior to the June 2021 annual meeting.  In the months leading up to annual shareholder meetings many stocks end up becoming “Hard to Borrow” with additional rates and fees to borrow them.  The reason for this is that people who lend out shares do not get a vote at the annual shareholders meeting.  You can go back and research this historically for many companies and a quick google search will show you that last year GME shares had to be called back prior to 4/20/20 in order to vote at the shareholders meeting.  With all eyes on GME this year and the corporate changes my feeling is that this year will be no different.  I just hope the use the same callback date of 4/20 for obvious reasons.  The shareholders meeting is in June this year and I think it will be a great time for retail investors to go meet and greet since we know when we get together it will be one hell of a party.\n\nLike I said I am not claiming any one of these things will happen or cause a catalyst but I thought it was important to get these things out in the open so everyone had an understanding of upcoming events.  Like it is repeated over and over again we don’t know when the squeeze will occur because we don’t know the shorters positions and where they feel their line is on cost to hold vs cost to give us our tendies. All we know is when it happens hold on.\n\nThank you for reading, hope you are all well informed.  Please do outside research and don’t rely on any one person as this is not financial advice.  I’m just a fellow ape holding GME that’s eats the crayons my wife’s boyfriend brings me when he comes over.  I prefer the orange crayons. I am not a cat. I like the stock. I thank you for the opportunity to bring you this information as it’s great information however I don’t have any good stories about growing up as a small child in Bulgaria.\n\nObligatory \n🦍🦍🦍💪💪💪💎💎💎🙌🙌🙌🚀🚀🚀🌛🌛🌛", "comments": [{"body": "I find it strange that Gamestop hasnt made an announcement on the halting of their stock by the brokers. Its fishy enough (Especially with the holes in RH's Story) to warrant an investigation from the company itself. \n\nI cant imagine execs at GME are content with how that played out.", "created": 1613927761.0}, {"body": "Don’t forget everyone here loved GameStop’s rewards system everyone bought 1 or 5", "created": 1613927662.0}, {"body": "Ive been here before it got deleted 🙈", "created": 1613927845.0}, {"body": "Inb4 this gets deleted", "created": 1613928893.0}, {"body": "Great analysis, I've made an analysis of my own today of GME: [https://www.youtube.com/watch?v=yGlvvANhh9Q&t=1s&ab\\_channel=DilligentCharge](https://www.youtube.com/watch?v=yGlvvANhh9Q&t=1s&ab_channel=DilligentCharge)", "created": 1613928985.0}], "created": 1613927565.0}, {"title": "Tiered entrances, investing in bubbles. Safe practices discussion.", "text": "Allow me to vet myself quick: 🦍🍌💎🙌🚀🌕. I'm a dumbass and this is not financial advice. Be your own boss and do whatever the fuck you want.\n\n#So, we've all seen the posts of people sinking their 401k's into GME at $300+.\n\nObviously, any financial advisor would tell you this is stupid. It seems like it would've paid off without RH's fuckery, but hypotheticals don't mean jack shit when we're in the situation we are. Let's propose some anyways.\n\n#So, how do you safely enter a volatile market when you've been out-of-the-loop?\n\nWell, my strategy is simply to inverse the idea of tiered exits into tiered entry points.\n\nLet's take Gamestop, since I assume most people are aware of the situation with its price. 2 weeks ago, GME was valued at $60. A week later, it hit $50, and even made a sprint down to $40. Somebody out-of-the-loop has 1k in liquid capital is looking to invest in Gamestop. They're itching to get a ticket to the rocket ship. They can buy 3 shares at $300 and wait if they'd like.\n\nBut what if they only bought one share at $300? If the price rockets, great, they made a quick buck of their initial invest. But what if it tanks. We know the shorts still have to cover, but the price tanking is too juicy of an opportunity to pass up.\n\nIf the price hits $60, this person may look at the situation, and go \"I want 5 more shares at this price.\" Well, now that person owns 6@$100, and has $400 in capital to throw around. This person then decides to wait until Friday before close next week to see where things are before options expire. The price hits $40, and they scoop up 10 more shares with the remainder of their ear-marked capital. They now have 16@$62.5.\n\n#The Results\nFor simplicity, let's assume this person wishes to exit their positions at 1k. The payoff scales with the price, so the exact exit price doesn't matter yet.\n\n#Scenario 1\nThis person invest $900 for 3 shares, the price skyrockets and they exit with $2100, doubling their initial investment with a substantial amount of risk involved.\n\n#Scenario 2\nThe stock takes off, but our investor has decided to hold onto their capital. The price goes to 1k, they cash out and are at $1700 net. Not that far off Scenario 1, but much lower risk.\n\n#Scenario 3 - Present Circumstances\nHere's the dream scenario for the patient investor. The price skyrockets to 1k, and they liquidate at the peak. Their $1,000 turns into $16,000. They patiently await the price decreasing so that they can reinvest, doing so slowly and in a tiered fashion again on the way down to repeat the strategy. They don't truly know where the floor will be, but they want more GME and are willing to take some minor losses to ensure they can get in on the true floor.\n\n#Scenario 4 - Fuck\nSo what happens if things go tits up? Well, the hasty investor lost $900 and can't buy back in when the price tanks. They have $100 and change left over.\nThe patient investor lost $300, but can average down for pennies on the dollar if they still believe the company can pull back. If they followed scenario 3, even selling at $20 nets them $320. The patient investor lost 1/3rd less than their impatient brethren. But at $60 entry, they can simply wait out their position for a year and see what Ryan Cohen does. The impatient investor simply cannot do this, their price of entry is too high and they're out of liquid capital. They have to invest FAR MORE in order to recover their initial investment.\n\n#Lesson\nBe patient. Don't throw all your capital around at once if you're Out-Of-The-Loop. FOMO will destroy your potential gains and increase your risk. Be analytical and calculating. Plan for the unexpected, and your profile will look a lot better.\n\nThe prices don't matter, this is about trends. Replacing the above numbers with other numbers will result in the same trends appearing with differing degrees of profit.\n\n#Tier your exits, tier your entrances, be patient and logical.\nThank you for coming to my shed talk. Discussion is down below and the moon is up above.", "comments": [{"body": ">Be analytical and calculating\n\nBeing retarded and impulsive hasn't worked out great so far, so maybe I'll try analculating", "created": 1613927171.0}, {"body": "Sir, this is a GameStop dispensary.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "created": 1613926468.0}, {"body": "Ahem.... sir this is a Wendy", "created": 1613926861.0}, {"body": "This sub has become riddled with entry level dumb shit from gen-z neckbeards. Its pathetic.", "created": 1613928265.0}, {"body": "I personally like tiered entrances, and cash out in one fell swoop. With volatile meme stocks the best thing for me is to cash entirely out when ready just so I have a large capital pool to use for next moves. \n\nAlso just generally because when things are done, they’re done esp with the memes (imo).", "created": 1613928648.0}], "created": 1613926468.0}, {"title": "Why I have a SEMI for BESI", "text": "**OK APES BLUF**: Orders up 65.8% vs. Q3-20. FY-20 Revenue and Net Income up 21.7% and 62.7% vs. FY-19. Proposed Dividend of € 1.70 per Share, up 68.3%.  This is a rocket ship ready to blast off in the semiconductor shortage.\n\n€BESI // $BESI.Y\n\n**BESI what do?**\n\nLeading assembly equipment supplier with #1 and #2 positions in key markets. 32% addressable market share.  Customers are primarily leading semiconductor manufacturers, assembly subcontractors and electronics and industrial companies.  That is Samsung, TSMC, & Qualcomm.\n\n*Ape speak: they make the shovels in the gold rush.*\n\nWhy BESI? -  *Richard Blickman* BESI CEO knows how to upscale his business during surging demands and has demonstrated time and time again in the cyclical semi industry.  He will direct the company to grow their market share a forecasted 20% this year!  ***Their order book for Q1-21 has already exceeded Q4-20.***  Their market share is as a result of long partnerships with IDMs, supply chains and others.  He's a master of capital allocation and knows the market, look at how he has flipped the business to match consumer demands, and positioned BESI in the Asian market.\n\n**Semi shortage:**\n\nSo nobody can even get a semi these days?? We need to get rock hard.  Revenue in the Foundry industry was up 23% last year to $82 billion. Counterpoint shook its Magic 8 ball and is now calling for growth of 12% this year bringing revenue to $92 billion. TSMC should grow 13% to 16%  this year staying pretty much in line with the industry's overall growth rate. We have already seen good commitments to CAPEX for building foundries, which is good news for BESI and their product lines. As the companies look to expand they need assembly equipment to grow!!\n\n**A cyclical business and detachment from trends:**\n\nFor those unfamiliar with semi's sometimes they go down, sometimes they go up - it depends on how many semis are going around.  This time with a semiconductor shortage we go parabolic. It is the nature of the semi.. but as the good lord says use it or lose it and never waste a semi.\n\nTypically we observe these cyclical trends in the business.\n\n&#x200B;\n\n[Increased Cash Flow Efficiency](https://preview.redd.it/z17ralkm0vi61.png?width=1582&format=png&auto=webp&s=8f039a7d4b30c2e85ad4a589bdb2969759364ddc)\n\nBESI is well positioned for upscaling, you need only observe their cashflow efficiency in previous semiconductor cycles. After a low period an observed strong rocket follows.  This time with the detachment of the cyclical business as a result of the war on semiconductors we will see continuous rocket ship.\n\n&#x200B;\n\n[Revenue and Gross Marge cyclical trends](https://preview.redd.it/tw6kzjcs0vi61.png?width=2227&format=png&auto=webp&s=4da39569ed07bacb81196f124b7cbeece6adbf18)\n\nIncrease in margin over the previous years is a testament to their business model and the cash cow they have created.\n\nIn a letter sent to sleepy joe 18th Feb, SEMI, the industry association serving the global electronics design and manufacturing supply chain, and 16 organizations representing industries including automotive, medical and technology urged the Biden administration to bolster domestic semiconductor manufacturing and research. The letter calls for funding the initiatives authorized in the CHIPS for America Act and the enactment of a federal investment tax credit (ITC) for semiconductor manufacturing facilities and equipment that would quickly provide a significant, direct and transparent incentive to all companies investing in new and expanded semiconductor facilities in the United States. Without further support, the letter warned, the country’s:\n\n>“technology leadership is at risk”.\n\nPretty much nobody can hold a semi in their hand and it don't matter if you're Hank in his ranch, or Hawa in Timbuktu.  Everyone is gearing up, and this rocket ship is about to blast off.\n\n**Share Repurchases**: \\~ €35million committed to share buybacks to programme extended until October 30, 2021. Increased to \\~€10MM/quarter from \\~€3MM/quarter.  == Strong confidence in their stonk.\n\n**Dividend** \\- 2.6% dividend, relatively moderate and hopefully appease some boomers. Typical capital allocation has a strong preference for share repurchases which is better for BESI share price.\n\n**Lookahead**\n\n* 20% market growth now estimated for 2021\n* 36% growth forecast between 2020 to 2023E\n* Strong secular market fundamentals:\n   * 5G, Datacenter and AI are primary drivers\n* New process technologies:\n   * Hybrid bonding, CSP adoption as device geometries shrink further\n* Revenue +30-40% for Q1-21\n* Gross Margin 58-60% for Q1-21\n\n**TLDR:** My argument is that the semiconductor industry has detached from it's previous cyclical traintracks due to the arising semiconductor war brewing between USA and Asia. I think this rocket ship is just fueling up and ready to blast off. As both sides scale up, money will flow towards the bottleneck in this industry: the assembly and manufacturing equipment - my answer to profit: BESI.\n\nThis is not financial advice I just like the stonk!\n\nPositions: €70 calls expiry sept/dec", "comments": [{"body": "Alright, I kinda get it. Good luck on this, might put in something myself.", "created": 1613926598.0}, {"body": "The shortage is mostly automotive. Those semiconductors are $1 or 2 a piece. From a company standpoint are you going to make the $30-40 iPhone chip or the dollar auto chip? This could lead to prices increasing as demand is so high. Likely to level out in the long term but possibly some money to be made over the next few months", "created": 1613928233.0}], "created": 1613925967.0}]}