{"data": [{"title": "Candlestick Analysis and $PLTR", "text": "If you've traded based on TA for any amount of time you probably already know that indicators behave differently between different sectors and tickers, and you probably already know that you need a confirmation to support your original indicator. Except for Candlestick Analysis, where you confirm the previous indictor with the proceeding stick.\n\n&#x200B;\n\nThis brings us to PLTR, where I noticed something interesting. While there is a small sample size, Candlestick Analysis has had a 100% success rate on the ticker.\n\n&#x200B;\n\n[https://www.americanbulls.com/SignalPage.aspx?lang=en&Ticker=PLTR](https://www.americanbulls.com/SignalPage.aspx?lang=en&Ticker=PLTR)\n\n&#x200B;\n\nThis means that if you traded the ticker based solely on this indicator, to date, you'd have a won all your trades.\n\n&#x200B;\n\nThis makes sense if you consider CSTA was developed to track the rice trade in the 18th century, and with the ticker being picked up by a lot of retail investors and hedgefunds probably trying to avoid tickers mentioned on social media. You have a more pure market in the ticker, and capture more emotion than other tickers.\n\n&#x200B;\n\nAnyways, just something I noticed, and wanted to share.", "comments": [{"body": "Nice might try day trading pltr a bit this week", "created": 1613931377.0}], "created": 1613931228.0}, {"title": "Me And A Broker Looking At GME And AMC stock - Supply And Demand Equal Price!", "text": "Me: GME And AMC Stock Supply and Demand\n\nMy Theory: Higher Demand Equal's Less Product And In Turn Means Higher Product Price\n\nMe: Buy GME at $87 Buy AMC at $12\n\nMe Market: Shares Available Of GME and AMC Drop Substantially Over A 2 Week Time Period\n\nMe Week 3: Nearly No Stocks Available Of GME, And Price Is $40 per share\n\nMe Week 3: No One Is Selling \n\nMe Week 3 : GME And AMC Stock Is Being Bought Up Left And Right When There May Not Be Any Shares Available On The Market.\n\nMe Week 3: Demand For Both Stocks Is At A All Time High And On Any Other Stock Price It Should Be Valued And Sold In The Thousands Of $$$ Yet They Are Both Sitting At The Numbers Of A Stock Price Of A Unwanted Stock\n\nBroker Week 3: Supply And Demand Do Not Work Into This Equation With  GME  and AMC  Because Hedge Funds Have Decided To Change  The Rules Mid Way Through The Game. GME and AMC are going bankrupt, Dont Invest Intro Them. HF's Have Killed That Market And And The Price Will Never Go Up.  Put Your Money Into Jenny May Certificates At 5% Interest\n\nMe Week 4: Fuck Jenny May At 5%, Buy More GME And AMC On Monday 2-02-2021 And Let It Ride!", "comments": [{"body": "Sir, this is the YMCA glory hole", "created": 1613930626.0}, {"body": "Why and how is this DD?", "created": 1613930702.0}, {"body": "How do you know no shares are available to buy?", "created": 1613930838.0}, {"body": "02/02/2021‽\n\n#TimeTraveler", "created": 1613930871.0}, {"body": "Aren’t you guys still letting the hedge funds use your shares? lol", "created": 1613930929.0}], "created": 1613930508.0}, {"title": "------ I'm beginning to feel like a Cap God ------", "text": "&#x200B;\n\n[u\\/DeepFuckingValue if he was Eminem](https://preview.redd.it/2wjlma7ycvi61.png?width=377&format=png&auto=webp&s=9ded9b55653e63b569c9256754d4d0f98ba598e9)\n\nAll Wall Street Bets from the front page to the back nod (back nod)\n\nNow who'll squeeze stock long enough to clap fraud (clap fraud)\n\n\\-\n\nBut for me to tap buy like reddit (u/)DFV's GMEs,\n\nI bought a laptop and I pass locked it\n\nMy position goes off when I half-dock it\n\nGot a fat knob with uncapped profit\n\nMade a killin' and I'm billin' off it\n\nEver since shill Shit-ron called us autists\n\nWith all of C-NBC feeling on it's nutsack\n\nHands are gems, see? Fill the rocket\n\nBut as rude and indecent as we talk, Us bulls win the markets\n\n\\-\n\nThis flippity dippity scrip drip-dopped?\n\nYou don't really want to get into a pissing match\n\nWith this sleek fair haired freak of meme 'nature'\n\nSnared bears' short shares are like sparrows scared air tears, rare their glare dares stare there\n\nPrepare to poorly fare if attempting to match wills, comparing skills\n\nPrayer moves no markets' heels\n\nAnd we'll still be lighting a motherfuckin flare\n\nto brighten up that fake-ass hair-cut you wear and swear\n\nis real 'militaire'\n\n\\-\n\nI just think that it's ironic \n\nThat it was the Robinhood robbin' the hood\n\n\"How could it not grow?\"\n\n\"All they do is invest bonds\"\n\nFeel my pair of red \"pears\" (two stocks \\~@325 lmao)\n\nTraders are having a tough time peariod\n\nCause there's paper hands\n\nIt's actually spectacularly black\n\nFor those of us masterfully holding these rare stonks back\n\n\\-\n\n\\-\n\n\\-\n\n>!Yes I made an actual music video rapping this + (poorly) animating the art. YouTube link sharing is banned though so I can't include it here for now. Will edit it in later if mods allow.!<\n\n\\-\n\nDISCLAIMER: This is a parody song. This song is not meant as financial advice. This song is fat-free, low-calories, and contains no \\*added\\* salt. This song exaggerates for comedic effect. Many of the opinions expressed herein do not necessarily reflect the actual views of the author/speaker. Leave Britney alon-\n\n\\-\n\nCREDITS:\n\nEminem: \"Rap God\"\n\nMrParadise: \"Max Headroom Background\"\n\nCrossdogz (???): DFV in WSB style", "comments": [{"body": "*cringe God*", "created": 1613930519.0}, {"body": "Save some pussy for the rest of us..", "created": 1613930535.0}, {"body": "Nothing will beat that Hamilton PLTR rap.\n\nFuck this cringe shit.", "created": 1613930764.0}, {"body": "This is what too much Adderall and and porn does to a 14 year old", "created": 1613930950.0}, {"body": "Ok now make a video rapping it.", "created": 1613930631.0}], "created": 1613930341.0}, {"title": "You'll say I'm a shill... Fine. My small argument for why AMC is a distraction from GME.", "text": "Let me preface this by saying I'm not a shill or 🌈🐻. My post and comment history should show this.\n\nMy argument:\n\nAMC is, and had ALWAYS been, a distraction from GME.\n\n6 months ago, \"AMC is dead!\" was all you saw. Everyone was all \"What's the point if I can stream at home and not have to pay $20 for two drinks and popcorn?\" or \"I can pause and go take a shit and not miss anything at home!\". I made bank on $2 AMC puts because I like money. It was almost to $1.\n\nDisney released Mulan direct to streaming on their app.\n\nHBO released Wonder Woman 1984 direct to streaming on their app.\n\nNow we're all \"Save AMC!!\"??? \n\nJust seems odd, in my opinion, that this movement started at the exact same time that the GME drama was unfolding. As if someone at a HF said \"We're going to stop the squeeze, that's easy, but we have to distract and divide the play. Let's throw some heartfelt nostalgia at them. They won't be able to resist!\" (This is obviously not even taking any of the CLEARLY bullshit plays people have been trying to start... Hi, SLV)\n\nI cannot find record of this magical 13f filling showing GSA Capital bought $270,000 worth of AMC that's being reported on various websites and other subreddits. Maybe you can? But if you can't find it either, I'm calling foul.\n\nI CAN find PROOF that Silver Lake Group, LLC, one of the largest tech equity firms, either completely sold or converted about 33m shares... (Unsure how to interpret this document. Maybe someone else can?):\n\n[https://sec.report/Document/0000899243-21-003743/](https://sec.report/Document/0000899243-21-003743/)\n\nThat said, anyone else notice that #Tuesday2Million did literally nothing? Me too.\n\nI'm in AMC, but I don't plan on adding more unless more ACTUAL news (with proof) should come to light.\n\nMaybe I'm right? Maybe I'm wrong? I've got skin in the game because I want to be wrong, but I have a sneaking suspicion otherwise. You do realize that the recent Forbes article about \"Amazon to buy AMC?\" was an idea originally rumored back in May 2020. This isn't new news. Just a regurgitated rumor, most likely paid to publish, to distract further.", "comments": [{"body": "Every single other stock is a distraction right? Maybe there would only be one stock and all other stocks be untradable", "created": 1613930137.0}, {"body": "Hodling.", "created": 1613930419.0}, {"body": "Just wait until AMC starts selling crayons as snacks, booom 🚀🚀", "created": 1613930662.0}, {"body": "I agree, AMC was a distraction. You would be a moron to YOLO your money on a stock that doesn't have sentimental and institutional backing like GME does. If we didn't halve our money and instead put 100% in GME, it would be well above 100 dollars right now...", "created": 1613930445.0}, {"body": "Just out here waiting on the patch like everyone else..hoping it’s NOK this time", "created": 1613930504.0}], "created": 1613929963.0}]}